# Understand the datasets

The following three datasets are available on the city of Chicago's Data Portal:

1.  <a href="https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Socioeconomic Indicators in Chicago</a>
2.  <a href="https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Public Schools</a>
3.  <a href="https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01">Chicago Crime Data</a>

## 1. Socioeconomic Indicators in Chicago

This dataset contains a selection of six socioeconomic indicators of public health significance and a “hardship index,” for each Chicago community area, for the years 2008 – 2012.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2](https://data.cityofchicago.org/Health-Human-Services/Census-Data-Selected-socioeconomic-indicators-in-C/kn9c-c2s2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

## 2. Chicago Public Schools

This dataset shows all school level performance data used to create CPS School Report Cards for the 2011-2012 school year. This dataset is provided by the city of Chicago's Data Portal.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

## 3. Chicago Crime Data

This dataset reflects reported incidents of crime (with the exception of murders where data exists for each victim) that occurred in the City of Chicago from 2001 to present, minus the most recent seven days.

A detailed description of this dataset and the original dataset can be obtained from the Chicago Data Portal at:
[https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2](https://data.cityofchicago.org/Public-Safety/Crimes-2001-to-present/ijzp-q8t2?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01&cm_mmc=Email_Newsletter-\_-Developer_Ed%2BTech-\_-WW_WW-\_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

### Store the datasets in database tables

To analyze the data using SQL, it first needs to be loaded into SQLite DB.
We will create three tables in as under:

1.  **CENSUS_DATA**
2.  **CHICAGO_PUBLIC_SCHOOLS**
3.  **CHICAGO_CRIME_DATA**

# Connect to the database

In [1]:
import sqlite3
import pandas as pd

In [2]:
sql_connect = sqlite3.connect("socioeconomic.db")

In [3]:
cursor = sql_connect.cursor()

In [4]:
df1 = pd.read_csv('https://data.cityofchicago.org/resource/kn9c-c2s2.csv')
df1.to_sql("CENSUS_DATA", sql_connect, if_exists='replace', index=False,method="multi")

78

In [5]:
df1.columns

Index(['ca', 'community_area_name', 'percent_of_housing_crowded',
       'percent_households_below_poverty', 'percent_aged_16_unemployed',
       'percent_aged_25_without_high_school_diploma',
       'percent_aged_under_18_or_over_64', 'per_capita_income_',
       'hardship_index'],
      dtype='object')

In [6]:
df1['ca']

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
      ...
73    74.0
74    75.0
75    76.0
76    77.0
77     NaN
Name: ca, Length: 78, dtype: float64

In [7]:
df1

,ca,community_area_name,percent_of_housing_crowded,percent_households_below_poverty,percent_aged_16_unemployed,percent_aged_25_without_high_school_diploma,percent_aged_under_18_or_over_64,per_capita_income_,hardship_index
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0
2,3.0,Uptown,3.8,24.0,8.9,11.8,22.2,35787,20.0
3,4.0,Lincoln Square,3.4,10.9,8.2,13.4,25.5,37524,17.0
4,5.0,North Center,0.3,7.5,5.2,4.5,26.2,57123,6.0
...,...,...,...,...,...,...,...,...,...
73,74.0,Mount Greenwood,1.0,3.4,8.7,4.3,36.8,34381,16.0
74,75.0,Morgan Park,0.8,13.2,15.0,10.8,40.3,27149,30.0
75,76.0,O'Hare,3.6,15.4,7.1,10.9,30.3,25828,24.0
76,77.0,Edgewater,4.1,18.2,9.2,9.7,23.8,33385,19.0
77,NaN,CHICAGO,4.7,19.7,12.9,19.5,33.5,28202,NaN

In [8]:
df2 = pd.read_csv('https://data.cityofchicago.org/resource/9xs2-f89t.csv')
df2.to_sql("CHICAGO_PUBLIC_SCHOOLS", sql_connect, if_exists='replace', index=False,method="multi")

566

In [9]:
df2.columns

Index(['school_id', 'name_of_school', 'elementary_or_high_school',
       'street_address', 'city', 'state', 'zip_code', 'phone_number', 'link_',
       'network_manager', 'collaborative_name',
       'adequate_yearly_progress_made_', 'track_schedule',
       'cps_performance_policy_status', 'cps_performance_policy_level',
       'healthy_schools_certified_', 'safety_icon_', 'safety_score',
       'family_involvement_icon', 'family_involvement_score',
       'environment_icon_', 'environment_score', 'instruction_icon_',
       'instruction_score', 'leaders_icon_', 'leaders_score_',
       'teachers_icon_', 'teachers_score', 'parent_engagement_icon_',
       'parent_engagement_score', 'parent_environment_icon',
       'parent_environment_score', 'average_student_attendance',
       'rate_of_misconducts_per_100_students_', 'average_teacher_attendance',
       'individualized_education_program_compliance_rate_', 'pk_2_literacy',
       'pk_2_math_', 'gr3_5_grade_level_math', 'gr3_5_grade_level_read_',
       'gr3_5_keep_pace_read_', 'gr3_5_keep_pace_math',
       'gr6_8_grade_level_math', 'gr6_8_grade_level_read',
       'gr6_8_keep_pace_math', 'gr6_8_keep_pace_read', 'gr_8_explore_math',
       'gr_8_explore_read', 'isat_exceeding_math_', 'isat_exceeding_reading_',
       'isat_value_add_math', 'isat_value_add_read',
       'isat_value_add_color_math', 'isat_value_add_color_read',
       'students_taking_algebra', 'students_passing_algebra',
       '_th_grade_explore_2009_', '_th_grade_explore_2010_',
       '_th_grade_plan_2009_', '_th_grade_plan_2010_',
       'net_change_explore_and_plan', '_th_grade_average_act_2011_',
       'net_change_plan_and_act', 'college_eligibility_', 'graduation_rate_',
       'college_enrollment_rate', 'college_enrollment_number_of_students_',
       'general_services_route_', 'freshman_on_track_rate', 'rcdts_code',
       'x_coordinate', 'y_coordinate', 'latitude', 'longitude',
       'community_area_number', 'community_area_name', 'ward',
       'police_district', 'location'],
      dtype='object')

In [10]:
df3 = pd.read_csv('https://data.cityofchicago.org/resource/ijzp-q8t2.csv')
df3.to_sql("CHICAGO_CRIME_DATA", sql_connect, if_exists='replace', index=False,method="multi")

1000

In [11]:
df3.columns

Index(['id', 'case_number', 'date', 'block', 'iucr', 'primary_type',
       'description', 'location_description', 'arrest', 'domestic', 'beat',
       'district', 'ward', 'community_area', 'fbi_code', 'x_coordinate',
       'y_coordinate', 'year', 'updated_on', 'latitude', 'longitude',
       'location'],
      dtype='object')

In [12]:
df3['primary_type'].unique()

array(['THEFT', 'ROBBERY', 'CRIMINAL DAMAGE', 'BURGLARY',
       'MOTOR VEHICLE THEFT', 'ASSAULT', 'WEAPONS VIOLATION', 'BATTERY',
       'OTHER OFFENSE', 'ARSON', 'CRIMINAL TRESPASS',
       'OFFENSE INVOLVING CHILDREN', 'NARCOTICS', 'DECEPTIVE PRACTICE',
       'PUBLIC PEACE VIOLATION', 'STALKING', 'KIDNAPPING', 'HOMICIDE',
       'PROSTITUTION', 'SEX OFFENSE', 'CRIMINAL SEXUAL ASSAULT',
       'INTERFERENCE WITH PUBLIC OFFICER', 'INTIMIDATION'], dtype=object)

In [13]:
df3['community_area']

0      23
1       8
2      41
3      30
4      24
       ..
995    54
996    71
997     2
998    25
999    38
Name: community_area, Length: 1000, dtype: int64

# Problems

Now write and execute SQL queries to solve assignment problems

## Problem 1

#### Find the total number of crimes recorded in the CRIME table.

In [14]:
query1 = "Select count(*) as total_number_of_crimes from CHICAGO_CRIME_DATA" 

result1 = pd.read_sql_query(query1,sql_connect)
result1

   total_number_of_crimes
0                    1000

## Problem 2

#### List community areas with per capita income less than 11000.

In [15]:
query2 = "Select community_area_name, per_capita_income_ from CENSUS_DATA where per_capita_income_ < 11000" 

result2 = pd.read_sql_query(query2,sql_connect)
result2

  community_area_name  per_capita_income_
0  West Garfield Park               10934
1      South Lawndale               10402
2         Fuller Park               10432
3           Riverdale                8201

## Problem 3

#### List all case numbers for crimes  involving minors?(children are not considered minors for the purposes of crime analysis)

In [16]:
query3 = "Select case_number from CHICAGO_CRIME_DATA where primary_type = 'OFFENSE INVOLVING CHILDREN'"

result3 = pd.read_sql_query(query3,sql_connect)
result3

  case_number
0    JF523396
1    JF519241
2    JF519057
3    JF518827
4    JF524219
5    JF518107
6    JF517539

## Problem 4

#### List all kidnapping crimes involving a child?

In [17]:
query4 = "Select case_number,date,primary_type,description from CHICAGO_CRIME_DATA where primary_type='KIDNAPPING' \
and description like '%CHILD%'"

result4 = pd.read_sql_query(query4,sql_connect)
result4

,case_number,date,primary_type,description
0,JF519025,2022-12-21T15:30:00.000,KIDNAPPING,CHILD ABDUCTION / STRANGER

## Problem 5

#### What kinds of crimes were recorded at schools?

In [18]:
query5 = "Select name_of_school, primary_type from CHICAGO_CRIME_DATA as C, CHICAGO_PUBLIC_SCHOOLS as S \
where C.community_area = S.community_area_number"

result5 = pd.read_sql_query(query5,sql_connect)
result5

                                    name_of_school primary_type
0                   Alfred Nobel Elementary School        THEFT
1        Brian Piccolo Elementary Specialty School        THEFT
2               Daniel R Cameron Elementary School        THEFT
3                  George Westinghouse High School        THEFT
4          Harriet Beecher Stowe Elementary School        THEFT
...                                            ...          ...
9878             Crispus Attucks Elementary School      ASSAULT
9879  Daniel Hale Williams Prep School of Medicine      ASSAULT
9880            Irvin C Mollison Elementary School      ASSAULT
9881        Ludwig Van Beethoven Elementary School      ASSAULT
9882           Melville W Fuller Elementary School      ASSAULT

[9883 rows x 2 columns]

In [19]:
type_crime_at_school = pd.DataFrame(result5['primary_type'].unique())
type_crime_at_school = type_crime_at_school.rename(columns={0:'type of crimes recorded at schools'})
type_crime_at_school

   type of crimes recorded at schools
0                               THEFT
1                             ROBBERY
2                     CRIMINAL DAMAGE
3                            BURGLARY
4                 MOTOR VEHICLE THEFT
5                             ASSAULT
6                   WEAPONS VIOLATION
7                             BATTERY
8                       OTHER OFFENSE
9                               ARSON
10                  CRIMINAL TRESPASS
11         OFFENSE INVOLVING CHILDREN
12                          NARCOTICS
13                 DECEPTIVE PRACTICE
14             PUBLIC PEACE VIOLATION
15                           STALKING
16                         KIDNAPPING
17                           HOMICIDE
18                       PROSTITUTION
19                        SEX OFFENSE
20            CRIMINAL SEXUAL ASSAULT
21   INTERFERENCE WITH PUBLIC OFFICER
22                       INTIMIDATION

## Problem 6

#### List the average safety score for each type of school.

In [20]:
query6 = "Select elementary_or_high_school, avg(safety_score) as average_safety_score from CHICAGO_PUBLIC_SCHOOLS \
group by elementary_or_high_school" 

result6 = pd.read_sql_query(query6,sql_connect)
result6

  elementary_or_high_school  average_safety_score
0                        ES             49.520384
1                        HS             49.623529
2                        MS             48.000000

## Problem 7

#### List 5 community areas with highest % of households below poverty line

In [25]:
query7 = "Select community_area_name, percent_households_below_poverty from CENSUS_DATA order by \
percent_households_below_poverty desc nulls last Limit 5"

result7 = pd.read_sql_query(query7,sql_connect)
result7

  community_area_name  percent_households_below_poverty
0           Riverdale                              56.5
1         Fuller Park                              51.2
2           Englewood                              46.6
3      North Lawndale                              43.1
4  East Garfield Park                              42.4

## Problem 8

#### Which community area is most crime prone?

In [22]:
query8 = "Select community_area, count(*) as Number_of_Crime from CHICAGO_CRIME_DATA group by community_area \
order by number_of_crime desc Limit 1"

result8 = pd.read_sql_query(query8,sql_connect)
result8

   community_area  Number_of_Crime
0              28               46

## Problem 9

#### Use a sub-query to find the name of the community area with highest hardship index

In [23]:
query9 = "Select community_area_name from CENSUS_DATA \
where hardship_index = (Select max(hardship_index) from CENSUS_DATA)"

result9 = pd.read_sql_query(query9,sql_connect)
result9

  community_area_name
0           Riverdale

## Problem 10

#### Use a sub-query to determine the Community Area Name with most number of crimes?

In [24]:
query10 = "SELECT ca,community_area_name FROM CENSUS_DATA WHERE ca = (SELECT CCD.community_area\
    FROM CHICAGO_CRIME_DATA AS CCD GROUP BY CCD.community_area ORDER BY COUNT(CCD.community_area) DESC LIMIT 1) LIMIT 1;"

result10 = pd.read_sql_query(query10,sql_connect)
result10

     ca community_area_name
0  28.0      Near West Side